Catalogs/ВидыДопусковКРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ВидыДопусковКРаботам</Name>
			<Comment>vvv</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтролируемыеДолжности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыОпределенияСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСрокаДействия</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяИндивидуально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитываетсяАвтоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДопусковКРаботам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодборДолжностей(Команда)
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.ДолжностиОрганизаций.ФормаВыбора", СтруктураПараметры, Элементы.КонтролируемыеДолжности);
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеДолжностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ДолжностиОрганизаций") Тогда
		СтандартнаяОбработка = Ложь;
		Если Объект.КонтролируемыеДолжности.НайтиСтроки(Новый Структура("Должность", ВыбранноеЗначение)).Количество() = 0 Тогда
			Объект.КонтролируемыеДолжности.Добавить().Должность = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияСрокаДействияПриИзменении(Элемент)
	УстановитьДоступностьПериодичности();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьПериодичности()
	Элементы.СрокДействия.Доступность = Объект.СпособОпределенияСрокаДействия = РассчитываетсяАвтоматически;
	Элементы.Периодичность.Доступность = Объект.СпособОпределенияСрокаДействия = РассчитываетсяАвтоматически;
КонецПроцедуры //УстановитьДоступностьПериодичности()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РассчитываетсяАвтоматически = Перечисления.СпособыОпределенияСрокаДействия.РассчитываетсяАвтоматически;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.СпособОпределенияСрокаДействия = Перечисления.СпособыОпределенияСрокаДействия.ОпределяетсяИндивидуально;
		Объект.Периодичность = Перечисления.Периодичность.Год;
		Объект.СрокДействия = 1;
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	ВалютаУпрУчета  = Константы.ВалютаУправленческогоУчета.Получить();
	Если ЗначениеЗаполнено(ВалютаУпрУчета) Тогда
		Элементы.СуммаРасходов.Заголовок = "Сумма расходов организации (" + ВалютаУпрУчета.Наименование +")";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПериодичности();
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	Если Объект.СрокДействия <= 0 Тогда
		Объект.СрокДействия = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.СпособОпределенияСрокаДействия = РассчитываетсяАвтоматически
		И НЕ ЗначениеЗаполнено(Объект.Периодичность) Тогда
		Предупреждение("Периодичность аттестации не указана");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеДолжностиДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ДолжностиОрганизаций") Тогда
		СтандартнаяОбработка = Ложь;
		Если Объект.КонтролируемыеДолжности.НайтиСтроки(Новый Структура("Должность", ВыбранноеЗначение)).Количество() = 0 Тогда
			Элементы.КонтролируемыеДолжности.ТекущиеДанные.Должность = ВыбранноеЗначение;
		Иначе
			Предупреждение("Должность " + ВыбранноеЗначение + " уже присутствует в списке.");	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеДолжностиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и Копирование Тогда
		Элементы.КонтролируемыеДолжности.ТекущиеДанные.Должность = "";
	КонецЕсли;
КонецПроцедуры
